{
	"news" : [
		{
			"title" : "ICS is proud to be home to 2015 UPLB Outstanding Junior Faculty in the Physical Sciences",
			"content" : "The Institute of Computer Science (ICS), College of Arts and Sciences (CAS) is very proud that its very own, Reginald Neil Recario was named University of the Philippines Los Baños (UPLB) Outstanding Teacher Award in the Physical Sciences discipline (Junior Faculty).The official ceremony and awarding of the Plaque of Recognition will be held on 5 March 2015, as stated on the letter of notification received by Sir Regi (the name his students and colleagues call him). Sir Regi is an Assistant Professor 1 at ICS, CAS. He is a graduate of BS Computer Science here in UPLB. After graduating, he immediately started teaching in the institute as an Instructor in 2008. After a year of teaching, he started his Masters in Information Technology and finished it in 2012. When asked of his achievements or accomplishments which he thinks made him the recipient of the prestigious award, Sir Regi said that he thinks it is because he innovates. He uses up­-to­-date materials and tries new methods of teaching."
		},
		{
			"title" : "Paper from the Traceability Program presented in PVMA 2015",
			"content" : "The paper A Pen-to-Plate Tracking and Tracing of Pork Through the National Pork Traceability System written by Prof. Jaderick P. Pabico with Ms. Joy B. Banayo, Prof. Marie Yvette B. de Robles, Prof. Medino Gedeun N. Yebron, Jr., Prof. Renato SA. Vega, Ph.D., Ms. Vianice Jasmine S. Olazo, Ms. Alyssa Kay S. Mojar, and Ms. Karen N. dela Cruz as co-authors was accepted and presented in the technical paper session on swine during the recently concluded 82nd Philippine Veterinary Medical Association Scientific Conference and Annual Convention (PVMA 2015) held at the Radisson Blu Hotel Cebu, Cebu City on 18-20 February 2015. The paper is one of the outputs of the collaborative R&D program Development of a National Pork Traceability System funded by the Philippine Council for Agriculture, Aquatic and Natural Resources Research and Development of the Department of Science and technology (PCAARRD-DOST). The paper presents the design of the National Pork Traceability System (NPTS) which was conceptualized in cooperation with PCAARRD-DOST, the National Meat Inspection Service (NMIS), and the Bureau of Animal Industry of the Department of Agriculture (BAI-DA). NPTS aims to track, trace, and verify the information on pork along the full length of the production and marketing chain. The paper might be one of the rare occasions, if not the only occasion, that a computer science-based paper was invited and presented at a scientific conference of an exclusive professional organization of veterinarians. The PVMA is the only recognized licensed veterinarian-only organization by the Professional Regulation Commission. The R&D Program is a collaborative effort of science researchers from the ICS and the Animal and Dairy Sciences Cluster (ADSC) of the College of Agriculture. Ms. J.B. Banayo, and Profs. R.SA. Vega and M.G.N. Yebron are from the ADSC. Profs. J.P. Pabico and M.Y.B. de Robles, and Mmes. V.J.S. Olazo, A.K.S. Mojar, and K.N. dela Cruz are from the ICS"
		},
		{
			"title" : "ICS research papers to be presented in conferences in January 2015",
			"content" : "A total of four ICS research papers will be presented in two separate conferences in January 2015. To be presented as oral paper in the 2015 International Conference on Building Resilience and Developing Sustainability (ICBRDS 2015) is the paper Mining the Sentiments in Social Media Microposts for Nowcasting Fish Kill Events in Taal Lake. The paper is one of the many outputs of the collaboration among ICS, IBS, and CHE involving Profs. Jaderick P. Pabico of ICS, Arnold R. Salvacion of CHE, and Damasa B. Magcale-Macandog of IBS. ICBRDS 2015 will be held in Baguio Convention Center and UP Baguio, Baguio City on 14-17 January 2015. Meanwhile, three ICS papers will be presented as oral papers in the 8th National Research Workshop on Modeling, Simulation and Scientific Computing (MODEL 2015) to be held in the the University Hotel, University of the Philippines Diliman on 19–20 January 2015. The three papers are A New Competitive Intelligence-based Strategy for Web Page Search by Mr. Iman Rasech, A Parallel Method for Metadata Correlation in Semantic Webs by Messrs. Rasech and Davoud Poor Yousefian Barfeh, and Data Manipulation Approaches in Learning a Model for Predicting Rare Events: A Case Study of the Taal Lake Fish Kill Predictive Model from Weather Data by Profs. Pabico, Salvacion, and Magcale-Macandog. Prof. Salvacion is from the Community and Environmental Resource Planning of the College of Human Ecology, while Prof. Magcale-Macandog is from the Ecoinformatics Laboratory of the Institute of Biological Sciences. Profs. Pabico, Salvacion, and Magcale-Macandog were involved in the DOST-funded Research Program Development of a Fishkill Early Warning System. Messrs. Rasech and Barfeh are Ph.D. in Computer Science students at ICS. Mr. Barfeh is also a member of the faculty in the College of Computer Studies of the Lyceum of the Philippines University (LPU)."
		},
		{
			"title" : "ICS researchers win NCITE Best Paper Awards anew",
			"content" : "Researchers from the Institute of Computer Science have won two out of four Best Paper Awards in the recently concluded First International Symposium on Computing for Education (ISCE 2014) and 12th National Conference on Information Technology Education (NCITE 2014) held on 23-25 October 2014 at the Crown Regency Hotel and Convention Center, Boracay, Malay, Aklan. Awarded Best Paper in Computer Science and Special Topics category is the paper titled Image Steganography using Block Edge Patterns written by undergraduate student David Kervin Salgado and Prof. Rizza DC. Mercado. The paper Development of an Online Automated Anthropometry Towards a National Database of Filipino Body Measurements by Profs. Katrina Joy H. Magno and Jaderick Pabico, instructor Kristine Bernadette P. Pelaez and undergraduate student Darwin James A. Abelardo won the Best Paper in Information Systems category. The two Best Paper awards given during NCITE 2014 mark the ninth such award given to ICS researchers since NCITE 2008. Every year (except the 2011 version which did not give a best paper award), at least one best paper award is given to an ICS contributed paper to the annual conference sponsored by the Philippine Society of IT Educators. NCITE has been a venue for IT Education researchers to promote Information Technology Education, as well as for them to exchange ideas, approaches, developments, and research results on various aspects of Computer Science, Information Technology, and Information Systems."
		},
		{
			"title" : "CFP: Seventh Symposium on Mathematical Aspects of Computer Science (SMACS 2014)",
			"content" : "SMACS 2014 is organized by the Computing Society of the Philippines SIG-Mathematical Aspects of Computer Science. It is the seventh meeting on the mathematical aspects of computer science that will be held in the Naga City, Camarines Sur organized by the Computing Society of the Philippines. The first was in 1997 (UPCB), the second was in 2004 (UP-Baguio), the third was in 2006 (AUP, Cavite), the fourth was in 2008 (UP Cebu Colleges), the fifth was in 2010 (UP Los Baños, Laguna), and the sixth edition was in Boracay Island, Malay, Aklan (La Carmela Resort and Hotel). This year's SMACS will be divided into two parts, workshop (24-26 November 2014) and seminar (27-28 November 2014). The workshop is designed such that researchers and instructors/lecturers of computing and mathematical sciences could interact on selected topics. Topics of the workshop will be tutorial in character which would lead to possible research collaboration. The seminar will consist of paper presentations on researches in the mathematical aspects of computer science. There will be invited talks on the current and still potent area of mathematical aspects of computer science. SMACS provides a venue for teachers, researchers and graduate students of Computer Science, Computing, and Mathematics to share and upgrade knowledge on areas of Computer Science which are mathematical or theoretical in character."
		}
	]
}